{
  "version": "1.2.0",
  "download_url": "https://www.mediafire.com/file/662c96b8e1gpn4u/AlgoFX1_3_0setup.exe/file",
  "release_date": "2025-04-19",
  "notes": [
    "Version 1.2.0 – mise à jour depuis la version initiale 1.1.0",
    "Vous pouvez désormais ouvrir les fichiers .algo directement en double-cliquant dessus",
    "Glissez-déposez les fichiers .algo dans l’IDE pour les ouvrir",
    "Nouvelle icône de la fenêtre",
    "Nouvel écran de démarrage (splash screen)",
    "Il est désormais possible de définir un nombre maximum d'étapes d'exécution dans les paramètres",
    "Vous pouvez maintenant utiliser la console externe ou la console intégrée",
    "Correction d’un fichier d’installation incorrect pour Windows 7",
    "Vous pouvez utiliser des parenthèses dans les conditions désormais",
    "La coloration syntaxique peut être activée ou désactivée",
    "Corrections mineures sur le thème sombre",
    "Nouveau bouton pour insérer une boucle For avec un pas",
    "Correction du non-opérateur qui ne fonctionnait pas dans certains cas",
    "Mise à jour du mot-clé 'power' en 'puissance'",
    "Nouveau guide pour l’écriture des algorithmes : Aide -> Syntaxe",
    "____________________________________________",
    "Version 1.3.0 programmée pour le 24/04/2025",
    "Correction d’un problème où AlgoFX se fermait de manière inattendue lors de l’édition du code avec l'autocomplétion activée.",
    "Amélioration des capacités de détection des erreurs de syntaxe.",
    "Ajout d’un nouveau bouton « Corriger l’indentation » dans la barre d’outils pour formater automatiquement votre code pour une meilleure lisibilité.",
    "Correction d’un bug empêchant la compilation correcte du code lorsqu’on utilisait « fin » au lieu de « Fin ».",
    "Nouvelles options disponibles : vous pouvez désormais choisir le français ou l’arabe pour la détection des erreurs de syntaxe avec une fenêtre améliorée.",
    "Amélioration de l’extraction du nom de l’algorithme, même en l’absence d’un point-virgule (« ; ») après le nom.",
    "Mise à jour du site Web pour indiquer clairement que Python et la variable d’environnement PATH sont requis pour exécuter l’option console avant le téléchargement.",
    "Correction d’un avertissement de dépréciation lié à l’écran de démarrage.",
    "Amélioration du mécanisme de persistance de la taille de la fenêtre.",
    "Résolution de problèmes mineurs et amélioration du style des thèmes clair/sombre.",
    "Mise à jour de la coloration syntaxique pour une meilleure lisibilité et un style plus clair.",
    "Les boutons d’insertion de fragments de code ont été mis à jour avec un nouveau style amélioré.",
    "Correction d’un bug où les opérations div et mod ne fonctionnaient pas correctement dans certaines conditions.",
    "Dans l'exécution intégrée, l'exécution s'arrête lorsque l'utilisateur clique sur 'Annuler' dans la boîte de saisie.",
    "L’installation initiale vous permet désormais de configurer l’autocomplétion, le mode d’exécution, la langue des messages (arabe/français) et le mode sombre."
  ]
}
